{"data":{"site":{"siteMetadata":{"title":"stackcheats"}},"markdownRemark":{"id":"c060bb20-f2a5-5316-be4f-ffc934a5a047","excerpt":"Brief Introduction SAML 2.0 SAML2 or SAML 2.0 is an XML-based framework, which is used to describe and exchange security information. SAML is commonly used for…","html":"<h2>Brief Introduction</h2>\n<h3>SAML 2.0</h3>\n<p>SAML2 or SAML 2.0 is an XML-based framework, which is used to describe and exchange security information. SAML is commonly used for Single Sign-On (SSO) and Identity Management and Federation.</p>\n<h3>OAuth 2.0</h3>\n<p>OAuth2 is an authorization framework used to enable applications to obtain limited access to resource owner (user) accounts.</p>\n<blockquote>\n<p>A quick glance and a story guide on OAuth2 framework and its grant-flows can be found here.</p>\n</blockquote>\n<p>Both OAuth2 and SAML have similar concepts and terms in between them.</p>\n<ul>\n<li>Resource Server = Service Provider</li>\n<li>Authorization Server = Identity Provider</li>\n<li>Client</li>\n</ul>\n<h2>Story Guide</h2>\n<p>Stackcheats is a private blog platform which uses <strong>SAML SSO</strong> to authenticate and authorize different writers and bloggers. Since Stackcheats has been a private blog platform, they have a new requirement on their development road-map to access writer’s technical blogs from their  Medium accounts.</p>\n<p>However, the Medium platform has been using <strong>OAuth2</strong> mechanism to authorize different users and writers to access and view various medium posts. A tech-developer named Athiththan have been requested to develop a solution.</p>\n<blockquote>\n<p>OAuth2 and SAML 2.0 are two different frameworks used to authorize and authenticate (OAuth doesn’t authenticate).</p>\n</blockquote>\n<p>This is where the SAML Bearer Assertion grant comes to play. The SAML Bearer Assertion grant is used to exchange the acquired SAML Assertion for an OAuth2 access token.</p>\n<p>To simply put, SAML Bearer Assertion grant-flow is very similar to the Authorization code grant-flow in OAuth, wherein SAML Bearer Assertion flow, a SAML Assertion is used instead of a cryptography code to gain an OAuth2 access token.</p>","frontmatter":{"title":"SAML Bearer Assertion","intro":"Quick Guide: SAML Bearer Assertion for OAuth 2.0","tags":["saml-bearer-assertion","saml","oauth2","wso2"],"author":"Athiththan"}}},"pageContext":{"slug":"/SAML-Bearer-Assertion/","node_id":"c060bb20-f2a5-5316-be4f-ffc934a5a047","nodePath":"/SAML-Bearer-Assertion/","nodeType":"sheet","title":"SAML Bearer Assertion","category":"WSO2","weight":-1,"updated":"2019-07-29T00:00:00.000Z","author":"Athiththan","short":"A Quick Guide on SAML Bearer Assertion using WSO2 Products","tags":["saml-bearer-assertion","saml","oauth2","wso2"]}}